app/views/decisions/show.html.erb

            <li class="information">
                <% if @decision.links.present? %>
---
SELECT "site_links".* FROM "site_links"

        </ul>
        <% unless @decision.categories.empty? %>
---
SELECT  1 AS one FROM "categories"  WHERE "categories"."decision_id" = $1 LIMIT 1  [["decision_id", 1]]
SELECT "categories".* FROM "categories"  WHERE "categories"."decision_id" = $1  [["decision_id", 1]]