app/controllers/admin/categories_controller.rb

  def new
    @decision = Decision.find params[:decision_id]
---
SELECT  "decisions".* FROM "decisions"  WHERE "decisions"."id" = $1 LIMIT 1  [["id", 1]]

  def create
    @category = Category.new(params[:category])

    respond_to do |format|
      if @category.save
---
INSERT INTO "categories" ("created_at", "decision_id", "description", "identifier", "name", "short_desc", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def update
    @category = Category.find(params[:id])

    respond_to do |format|
      if @category.update_attributes(params[:category])
---
SELECT  "categories".* FROM "categories"  WHERE "categories"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "categories" SET "name" = $1, "updated_at" = $2 WHERE "categories"."id" = 1  [["name", "category144"], ["updated_at", "2014-06-10 14:19:52.142786"]]