app/controllers/admin/datasets_decisions_controller.rb

SELECT  "datasets".* FROM "datasets"  WHERE "datasets"."id" = $1 LIMIT 1  [["id", 1]]
---
  def index
    @dataset = Dataset.find params[:dataset_id]

SELECT  "datasets_decisions".* FROM "datasets_decisions"  WHERE "datasets_decisions"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "decisions".* FROM "decisions"  WHERE "decisions"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    @datasets_decision = DatasetsDecision.find(params[:id])

SELECT  "datasets".* FROM "datasets"  WHERE "datasets"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "decisions".* FROM "decisions"   ORDER BY name ASC
---
  def new
    @dataset = Dataset.find params[:dataset_id]
    @datasets_decision = DatasetsDecision.new :dataset => @dataset
    @decisions = Decision.order("name ASC")

INSERT INTO "datasets_decisions" ("category_id", "dataset_id", "decision_id") VALUES ($1, $2, $3) RETURNING "id"  [["category_id", 1], ["dataset_id", 1], ["decision_id", 1]]
---
  def create
    @datasets_decision = DatasetsDecision.new(datasets_decision_params)

    respond_to do |format|
      if @datasets_decision.save

SELECT  "decisions".* FROM "decisions"  WHERE "decisions"."id" = $1 LIMIT 1  [["id", 1]]
---
  def categories_for_decision
    @decision = Decision.find params[:id]