app/controllers/admin/datasets_controller.rb

  def index
    @datasets = Dataset.all.order("order_number ASC")
---
SELECT "datasets".* FROM "datasets"   ORDER BY order_number ASC

  def show
    @dataset = Dataset.find(params[:id])
---
SELECT  "datasets".* FROM "datasets"  WHERE "datasets"."id" = $1 LIMIT 1  [["id", 1]]

  def edit
    @dataset = Dataset.find(params[:id])
---
SELECT  "datasets".* FROM "datasets"  WHERE "datasets"."id" = $1 LIMIT 1  [["id", 1]]

  def create
    @dataset = Dataset.new(dataset_params)

    respond_to do |format|
      if @dataset.save
---
INSERT INTO "datasets" ("long_desc", "licence_id", "created_at", "title", "meta_download", "metadata_description", "shp_download", "updated_at", "wfs", "wms", "short_desc") VALUES(E'hdhfdhfg', 2, '2009-12-01 18:01:51.573012', E'gfdgfhd', E'', E'hgfgfhd', E'', '2009-12-01 18:01:51.573012', E'', E'', E'hgfhgfd') RETURNING "id"

  def update
    @dataset = Dataset.find(params[:id])

    respond_to do |format|
      if @dataset.update_attributes(dataset_params)
---
SELECT  "datasets".* FROM "datasets"  WHERE "datasets"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "datasets" SET "updated_at" = $1, "wms_name" = $2 WHERE "datasets"."id" = 1  [["updated_at", "2014-06-10 14:50:34.201659"], ["wms_name", "Global Distribution of Coral reefs (2010)"]]

  def destroy
    @dataset = Dataset.find(params[:id])
    @dataset.destroy
---
SELECT * FROM "datasets" WHERE ("datasets"."id" = 2)
DELETE FROM "datasets" WHERE "id" = 2