app/controllers/admin/decisions_controller.rb

SELECT "decisions".* FROM "decisions"   ORDER BY order_number ASC
---
  def index
    @decisions = Decision.all

SELECT  "decisions".* FROM "decisions"  WHERE "decisions"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    @decision = Decision.find(params[:id])

SELECT  "decisions".* FROM "decisions"  WHERE "decisions"."id" = $1 LIMIT 1  [["id", 1]]
---
  def edit
    @decision = Decision.find(params[:id])

INSERT INTO "decisions" ("created_at", "description", "established", "key_points", "links", "name", "order_number", "short_name", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @decision = Decision.new(params[:decision])

    respond_to do |format|
      if @decision.save