app/controllers/admin/licences_controller.rb

SELECT "licences".* FROM "licences"
---
  def index
    @licences = Licence.all

SELECT  "licences".* FROM "licences"  WHERE "licences"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    @licence = Licence.find(params[:id])

SELECT  "licences".* FROM "licences"  WHERE "licences"."id" = $1 LIMIT 1  [["id", 1]]
---
  def edit
    @licence = Licence.find(params[:id])

INSERT INTO "licences" ("body", "created_at", "short_desc", "title", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "dsds"], ["created_at", "2014-06-10 14:08:37.225947"], ["short_desc", "t"], ["title", "tete"], ["updated_at", "2014-06-10 14:08:37.225947"]]
---
  def create
    @licence = Licence.new(params[:licence])

    respond_to do |format|
      if @licence.save

SELECT  "licences".* FROM "licences"  WHERE "licences"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "licences" SET "title" = $1, "updated_at" = $2 WHERE "licences"."id" = 1  [["title", "tete2"], ["updated_at", "2014-06-10 14:13:43.852447"]]
---
  def update
    @licence = Licence.find(params[:id])

    respond_to do |format|
      if @licence.update_attributes(params[:licence])

SELECT  "licences".* FROM "licences"  WHERE "licences"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "licences" WHERE "licences"."id" = $1  [["id", 1]]
---
  def destroy
    @licence = Licence.find(params[:id])
    @licence.destroy