app/controllers/admin/site_links_controller.rb

SELECT "site_links".* FROM "site_links"
---
  def index
    @site_links = SiteLink.all

SELECT  "site_links".* FROM "site_links"  WHERE "site_links"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    @site_link = SiteLink.find(params[:id])

SELECT  "site_links".* FROM "site_links"  WHERE "site_links"."id" = $1 LIMIT 1  [["id", 1]]
---
  def edit
    @site_link = SiteLink.find(params[:id])

INSERT INTO "site_links" ("body", "created_at", "link", "title", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", ""], ["created_at", "2014-06-10 14:33:13.558652"], ["link", ""], ["title", ""], ["updated_at", "2014-06-10 14:33:13.558652"]]
---
  def create
    @site_link = SiteLink.new(params[:site_link])

    respond_to do |format|
      if @site_link.save

SELECT  "site_links".* FROM "site_links"  WHERE "site_links"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "site_links" SET "body" = $1, "link" = $2, "title" = $3, "updated_at" = $4 WHERE "site_links"."id" = 1  [["body", "fdfddf"], ["link", "http://dziaba.pl"], ["title", "dfsfd"], ["updated_at", "2014-06-10 14:33:25.501575"]]
---
  def update
    @site_link = SiteLink.find(params[:id])

    respond_to do |format|
      if @site_link.update_attributes(params[:site_link])