app/views/datasets/_gmap.html.erb

SELECT "datasets".* FROM "datasets"   ORDER BY order_number ASC
SELECT COUNT(*) FROM "datasets"
---
        <span class="tick up"></span>
        Showing <%= pluralize(datasets.count, 'dataset') %>