app/views/datasets/index.html.erb

SELECT  "datasets_decisions".* FROM "datasets_decisions"  WHERE "datasets_decisions"."dataset_id" = 1 AND "datasets_decisions"."decision_id" = 1  ORDER BY "datasets_decisions"."id" ASC LIMIT 1
---
                          <%
                            datasets_decision = DatasetsDecision.where(:dataset_id => dataset, :decision_id => decision).first