app/views/datasets/show.html.erb

                <ul>
                  <% @dataset.datasets_decisions.each do |datasets_decision| -%>
---
SELECT "datasets_decisions".* FROM "datasets_decisions"  WHERE "datasets_decisions"."dataset_id" = $1  [["dataset_id", 1]]