app/views/admin/datasets/_form.html.erb

    <%= f.label :licence %><br />
    <%= collection_select(:dataset, :licence_id, Licence.all.order("title ASC"), :id, :title, {:prompt => true})%>
---
SELECT "licences".* FROM "licences"   ORDER BY title ASC