app/views/admin/decisions/_form.html.erb

    <%= f.label :group_parent %><br />
    <%= collection_select(:decision, :parent_id, Decision.all(:order => "name ASC"), :id, :name, {:prompt => true})%>
---
SELECT "decisions".* FROM "decisions"   ORDER BY name ASC