app/controllers/customers_controller.rb

  def create
    @dataset = Dataset.find(params[:dataset_id])
    @customer = Customer.new(params[:customer])
    @customer.dataset = @dataset
    @customer.licence = @dataset.licence

    if @customer.save
---
SELECT * FROM "datasets" WHERE ("datasets"."id" = 1)
INSERT INTO "customers" ("licence_id", "created_at", "title", "institution", "updated_at", "dataset_id", "licence_agreed", "last_name", "first_name", "email", "intended_use") VALUES(1, '2009-12-01 17:57:44.481299', E'sadfkjhsadjh', E'ajshdfgasjkhdfg', '2009-12-01 17:57:44.481299', 1, 't', E'gkhjghjghjg', E'jhgkjhgkhj', E'khjg@asdfasf.com', E'aksjhdfgaskjhdf') RETURNING "id"