app/controllers/datasets_controller.rb

  def index
    @datasets = Dataset.all
---
SELECT "datasets".* FROM "datasets"   ORDER BY order_number ASC

  def show
    @dataset = Dataset.find(params[:id])
---
SELECT  "datasets".* FROM "datasets"  WHERE "datasets"."id" = $1 LIMIT 1  [["id", 1]]