app/controllers/datasets_controller.rb

SELECT "decisions".* FROM "decisions"  WHERE "decisions"."parent_id" IS NULL  ORDER BY order_number ASC
---
  def index
    @datasets = Dataset.all.order("order_number ASC")
    @decisions = Decision.where(:parent_id => nil).order("order_number ASC")