app/controllers/decisions_controller.rb

  def show
    @decision = Decision.find(params[:id])
---
SELECT  "decisions".* FROM "decisions"  WHERE "decisions"."id" = $1 LIMIT 1  [["id", 1]]