app/controllers/factsheets_controller.rb

SELECT "datasets".* FROM "datasets"  WHERE (factsheet_file_name IS NOT NULL)
---
  def index
    @datasets = Dataset.find(:all, :conditions => 'factsheet_file_name IS NOT NULL')