app/controllers/licences_controller.rb

  def show
    @licence = Licence.find(params[:id])
---
SELECT  "licences".* FROM "licences"  WHERE "licences"."id" = $1 LIMIT 1  [["id", 2]]